# -*- coding: utf-8 -*-
"""
Created on Sun Jun 24 21:01:57 2018

@author: Phantom
"""

class Correction_level:
   
    
    pass

"""
Коррекционные движения рынка достигают кульминации на ключе-
вых уровнях возврата — 38, 50 или 62%,
ищу 
Такие небольшие движения рынка в обратном направлении называют
коррекцией , частичным возвратом или откатом и отсчитывают от самого
низкого минимума предыдущего тренда до самого высокого максимума

последнего тренда на растущем рынке, или от самого высокого максиму-
ма предыдущего тренда до самого низкого минимума последнего тренда

на падающем рынке. По резкости или мягкости коррекций можно судить
о силе или слабости господствующего рыночного тренда.
"""